espressif/esp-idf/components/soc/esp32c61/include/soc/gdma_reg.h
/** GDMA_OUT_DSCR_BF1_CH1_REG register
 *  The second-to-last transmit descriptor address of TX channel 0
 */
#define GDMA_OUT_DSCR_BF1_CH1_REG (DR_REG_AHB_GDMA_BASE + 0x1b8)
/** GDMA_OUTLINK_DSCR_BF1_CH1 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the previous transmit descriptor y-1 that has already
 *  been fetched.
 */
#define GDMA_OUTLINK_DSCR_BF1_CH1    0xFFFFFFFFU
#define GDMA_OUTLINK_DSCR_BF1_CH1_M  (GDMA_OUTLINK_DSCR_BF1_CH1_V << GDMA_OUTLINK_DSCR_BF1_CH1_S)
#define GDMA_OUTLINK_DSCR_BF1_CH1_V  0xFFFFFFFFU
#define GDMA_OUTLINK_DSCR_BF1_CH1_S  0

/** GDMA_OUT_PRI_CH1_REG register
 *  Priority register of TX channel 0
 */
#define GDMA_OUT_PRI_CH1_REG (DR_REG_AHB_GDMA_BASE + 0x1bc)
/** GDMA_TX_PRI_CH1 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the priority of TX channel 1.The larger of the value, the higher of the
 *  priority.
 */
#define GDMA_TX_PRI_CH1    0x0000000FU
#define GDMA_TX_PRI_CH1_M  (GDMA_TX_PRI_CH1_V << GDMA_TX_PRI_CH1_S)
#define GDMA_TX_PRI_CH1_V  0x0000000FU
#define GDMA_TX_PRI_CH1_S  0

/** GDMA_OUT_PERI_SEL_CH1_REG register
 *  Peripheral selection register of TX channel 0
 */
#define GDMA_OUT_PERI_SEL_CH1_REG (DR_REG_AHB_GDMA_BASE + 0x1c0)
/** GDMA_PERI_OUT_SEL_CH1 : R/W; bitpos: [5:0]; default: 63;
 *  Configures the peripheral connected to TX channel 1.\\ 0: Dummy\\ 1: SPI2\\ 2:
 *  UHCI0\\ 3: I2S0\\ 4: Dummy\\ 5: Dummy\\ 6: AES\\ 7: SHA\\ 8: ADC_DAC\\ 9: PARL_IO\\
 *  10: Dummy\\ 11~15: Dummy\\
 */
#define GDMA_PERI_OUT_SEL_CH1    0x0000003FU
#define GDMA_PERI_OUT_SEL_CH1_M  (GDMA_PERI_OUT_SEL_CH1_V << GDMA_PERI_OUT_SEL_CH1_S)
#define GDMA_PERI_OUT_SEL_CH1_V  0x0000003FU
#define GDMA_PERI_OUT_SEL_CH1_S  0

/** GDMA_OUT_DONE_DES_ADDR_CH1_REG register
 *  TX done outlink descriptor address of TX channel 0
 */
#define GDMA_OUT_DONE_DES_ADDR_CH1_REG (DR_REG_AHB_GDMA_BASE + 0x1d0)
/** GDMA_OUT_DONE_DES_ADDR_CH1 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the outlink descriptor when this descriptor is completed.
 */
#define GDMA_OUT_DONE_DES_ADDR_CH1    0xFFFFFFFFU
#define GDMA_OUT_DONE_DES_ADDR_CH1_M  (GDMA_OUT_DONE_DES_ADDR_CH1_V << GDMA_OUT_DONE_DES_ADDR_CH1_S)
#define GDMA_OUT_DONE_DES_ADDR_CH1_V  0xFFFFFFFFU
#define GDMA_OUT_DONE_DES_ADDR_CH1_S  0

/** GDMA_TX_CH_ARB_WEIGH_CH0_REG register
 *  TX channel 0 arbitration weight configuration register
 */
#define GDMA_TX_CH_ARB_WEIGH_CH0_REG (DR_REG_AHB_GDMA_BASE + 0x2dc)
/** GDMA_TX_CH_ARB_WEIGH_CH0 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the weight(i.e the number of tokens) of TX channel0
 */
#define GDMA_TX_CH_ARB_WEIGH_CH0    0x0000000FU
#define GDMA_TX_CH_ARB_WEIGH_CH0_M  (GDMA_TX_CH_ARB_WEIGH_CH0_V << GDMA_TX_CH_ARB_WEIGH_CH0_S)
#define GDMA_TX_CH_ARB_WEIGH_CH0_V  0x0000000FU
#define GDMA_TX_CH_ARB_WEIGH_CH0_S  0

/** GDMA_TX_ARB_WEIGH_OPT_DIR_CH0_REG register
 *  TX channel 0 weight arbitration optimization enable register
 */
#define GDMA_TX_ARB_WEIGH_OPT_DIR_CH0_REG (DR_REG_AHB_GDMA_BASE + 0x2e0)
/** GDMA_TX_ARB_WEIGH_OPT_DIR_CH0 : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define GDMA_TX_ARB_WEIGH_OPT_DIR_CH0    (BIT(0))
#define GDMA_TX_ARB_WEIGH_OPT_DIR_CH0_M  (GDMA_TX_ARB_WEIGH_OPT_DIR_CH0_V << GDMA_TX_ARB_WEIGH_OPT_DIR_CH0_S)
#define GDMA_TX_ARB_WEIGH_OPT_DIR_CH0_V  0x00000001U
#define GDMA_TX_ARB_WEIGH_OPT_DIR_CH0_S  0

/** GDMA_TX_CH_ARB_WEIGH_CH1_REG register
 *  TX channel 0 arbitration weight configuration register
 */
#define GDMA_TX_CH_ARB_WEIGH_CH1_REG (DR_REG_AHB_GDMA_BASE + 0x304)
/** GDMA_TX_CH_ARB_WEIGH_CH1 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the weight(i.e the number of tokens) of TX channel1
 */
#define GDMA_TX_CH_ARB_WEIGH_CH1    0x0000000FU
#define GDMA_TX_CH_ARB_WEIGH_CH1_M  (GDMA_TX_CH_ARB_WEIGH_CH1_V << GDMA_TX_CH_ARB_WEIGH_CH1_S)
#define GDMA_TX_CH_ARB_WEIGH_CH1_V  0x0000000FU
#define GDMA_TX_CH_ARB_WEIGH_CH1_S  0

/** GDMA_TX_ARB_WEIGH_OPT_DIR_CH1_REG register
 *  TX channel 0 weight arbitration optimization enable register
 */
#define GDMA_TX_ARB_WEIGH_OPT_DIR_CH1_REG (DR_REG_AHB_GDMA_BASE + 0x308)
/** GDMA_TX_ARB_WEIGH_OPT_DIR_CH1 : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define GDMA_TX_ARB_WEIGH_OPT_DIR_CH1    (BIT(0))
#define GDMA_TX_ARB_WEIGH_OPT_DIR_CH1_M  (GDMA_TX_ARB_WEIGH_OPT_DIR_CH1_V << GDMA_TX_ARB_WEIGH_OPT_DIR_CH1_S)
#define GDMA_TX_ARB_WEIGH_OPT_DIR_CH1_V  0x00000001U
#define GDMA_TX_ARB_WEIGH_OPT_DIR_CH1_S  0

/** GDMA_RX_CH_ARB_WEIGH_CH0_REG register
 *  RX channel 0 arbitration weight configuration register
 */
#define GDMA_RX_CH_ARB_WEIGH_CH0_REG (DR_REG_AHB_GDMA_BASE + 0x354)
/** GDMA_RX_CH_ARB_WEIGH_CH0 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the weight(i.e the number of tokens) of RX channel0
 */
#define GDMA_RX_CH_ARB_WEIGH_CH0    0x0000000FU
#define GDMA_RX_CH_ARB_WEIGH_CH0_M  (GDMA_RX_CH_ARB_WEIGH_CH0_V << GDMA_RX_CH_ARB_WEIGH_CH0_S)
#define GDMA_RX_CH_ARB_WEIGH_CH0_V  0x0000000FU
#define GDMA_RX_CH_ARB_WEIGH_CH0_S  0

/** GDMA_RX_ARB_WEIGH_OPT_DIR_CH0_REG register
 *  RX channel 0 weight arbitration optimization enable register
 */
#define GDMA_RX_ARB_WEIGH_OPT_DIR_CH0_REG (DR_REG_AHB_GDMA_BASE + 0x358)
/** GDMA_RX_ARB_WEIGH_OPT_DIR_CH0 : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define GDMA_RX_ARB_WEIGH_OPT_DIR_CH0    (BIT(0))
#define GDMA_RX_ARB_WEIGH_OPT_DIR_CH0_M  (GDMA_RX_ARB_WEIGH_OPT_DIR_CH0_V << GDMA_RX_ARB_WEIGH_OPT_DIR_CH0_S)
#define GDMA_RX_ARB_WEIGH_OPT_DIR_CH0_V  0x00000001U
#define GDMA_RX_ARB_WEIGH_OPT_DIR_CH0_S  0

/** GDMA_RX_CH_ARB_WEIGH_CH1_REG register
 *  RX channel 0 arbitration weight configuration register
 */
#define GDMA_RX_CH_ARB_WEIGH_CH1_REG (DR_REG_AHB_GDMA_BASE + 0x37c)
/** GDMA_RX_CH_ARB_WEIGH_CH1 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the weight(i.e the number of tokens) of RX channel1
 */
#define GDMA_RX_CH_ARB_WEIGH_CH1    0x0000000FU
#define GDMA_RX_CH_ARB_WEIGH_CH1_M  (GDMA_RX_CH_ARB_WEIGH_CH1_V << GDMA_RX_CH_ARB_WEIGH_CH1_S)
#define GDMA_RX_CH_ARB_WEIGH_CH1_V  0x0000000FU
#define GDMA_RX_CH_ARB_WEIGH_CH1_S  0

/** GDMA_RX_ARB_WEIGH_OPT_DIR_CH1_REG register
 *  RX channel 0 weight arbitration optimization enable register
 */
#define GDMA_RX_ARB_WEIGH_OPT_DIR_CH1_REG (DR_REG_AHB_GDMA_BASE + 0x380)
/** GDMA_RX_ARB_WEIGH_OPT_DIR_CH1 : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define GDMA_RX_ARB_WEIGH_OPT_DIR_CH1    (BIT(0))
#define GDMA_RX_ARB_WEIGH_OPT_DIR_CH1_M  (GDMA_RX_ARB_WEIGH_OPT_DIR_CH1_V << GDMA_RX_ARB_WEIGH_OPT_DIR_CH1_S)
#define GDMA_RX_ARB_WEIGH_OPT_DIR_CH1_V  0x00000001U
#define GDMA_RX_ARB_WEIGH_OPT_DIR_CH1_S  0

