espressif/esp-idf/components/soc/esp32c61/include/soc/gdma_reg.h
/** GDMA_IN_LINK_ADDR_CH0_REG register
 *  Link list descriptor address configuration of RX channel 0
 */
#define GDMA_IN_LINK_ADDR_CH0_REG (DR_REG_AHB_GDMA_BASE + 0x3ac)
/** GDMA_INLINK_ADDR_CH0 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 32 bits of the first receive descriptor's address.
 */
#define GDMA_INLINK_ADDR_CH0    0xFFFFFFFFU
#define GDMA_INLINK_ADDR_CH0_M  (GDMA_INLINK_ADDR_CH0_V << GDMA_INLINK_ADDR_CH0_S)
#define GDMA_INLINK_ADDR_CH0_V  0xFFFFFFFFU
#define GDMA_INLINK_ADDR_CH0_S  0

/** GDMA_IN_LINK_ADDR_CH1_REG register
 *  Link list descriptor address configuration of RX channel 0
 */
#define GDMA_IN_LINK_ADDR_CH1_REG (DR_REG_AHB_GDMA_BASE + 0x3b0)
/** GDMA_INLINK_ADDR_CH1 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 32 bits of the first receive descriptor's address.
 */
#define GDMA_INLINK_ADDR_CH1    0xFFFFFFFFU
#define GDMA_INLINK_ADDR_CH1_M  (GDMA_INLINK_ADDR_CH1_V << GDMA_INLINK_ADDR_CH1_S)
#define GDMA_INLINK_ADDR_CH1_V  0xFFFFFFFFU
#define GDMA_INLINK_ADDR_CH1_S  0

/** GDMA_OUT_LINK_ADDR_CH0_REG register
 *  Link list descriptor address configuration of TX channel 0
 */
#define GDMA_OUT_LINK_ADDR_CH0_REG (DR_REG_AHB_GDMA_BASE + 0x3b8)
/** GDMA_OUTLINK_ADDR_CH0 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 32 bits of the first receive descriptor's address.
 */
#define GDMA_OUTLINK_ADDR_CH0    0xFFFFFFFFU
#define GDMA_OUTLINK_ADDR_CH0_M  (GDMA_OUTLINK_ADDR_CH0_V << GDMA_OUTLINK_ADDR_CH0_S)
#define GDMA_OUTLINK_ADDR_CH0_V  0xFFFFFFFFU
#define GDMA_OUTLINK_ADDR_CH0_S  0

/** GDMA_OUT_LINK_ADDR_CH1_REG register
 *  Link list descriptor address configuration of TX channel 0
 */
#define GDMA_OUT_LINK_ADDR_CH1_REG (DR_REG_AHB_GDMA_BASE + 0x3bc)
/** GDMA_OUTLINK_ADDR_CH1 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 32 bits of the first receive descriptor's address.
 */
#define GDMA_OUTLINK_ADDR_CH1    0xFFFFFFFFU
#define GDMA_OUTLINK_ADDR_CH1_M  (GDMA_OUTLINK_ADDR_CH1_V << GDMA_OUTLINK_ADDR_CH1_S)
#define GDMA_OUTLINK_ADDR_CH1_V  0xFFFFFFFFU
#define GDMA_OUTLINK_ADDR_CH1_S  0

/** GDMA_INTR_MEM_START_ADDR_REG register
 *  Accessible address space start address configuration register
 */
#define GDMA_INTR_MEM_START_ADDR_REG (DR_REG_AHB_GDMA_BASE + 0x3c4)
/** GDMA_ACCESS_INTR_MEM_START_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of accessible address space.
 */
#define GDMA_ACCESS_INTR_MEM_START_ADDR    0xFFFFFFFFU
#define GDMA_ACCESS_INTR_MEM_START_ADDR_M  (GDMA_ACCESS_INTR_MEM_START_ADDR_V << GDMA_ACCESS_INTR_MEM_START_ADDR_S)
#define GDMA_ACCESS_INTR_MEM_START_ADDR_V  0xFFFFFFFFU
#define GDMA_ACCESS_INTR_MEM_START_ADDR_S  0

/** GDMA_INTR_MEM_END_ADDR_REG register
 *  Accessible address space end address configuration register
 */
#define GDMA_INTR_MEM_END_ADDR_REG (DR_REG_AHB_GDMA_BASE + 0x3c8)
/** GDMA_ACCESS_INTR_MEM_END_ADDR : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the end address of accessible address space.
 */
#define GDMA_ACCESS_INTR_MEM_END_ADDR    0xFFFFFFFFU
#define GDMA_ACCESS_INTR_MEM_END_ADDR_M  (GDMA_ACCESS_INTR_MEM_END_ADDR_V << GDMA_ACCESS_INTR_MEM_END_ADDR_S)
#define GDMA_ACCESS_INTR_MEM_END_ADDR_V  0xFFFFFFFFU
#define GDMA_ACCESS_INTR_MEM_END_ADDR_S  0

/** GDMA_ARB_TIMEOUT_TX_REG register
 *  TX arbitration timeout configuration register
 */
#define GDMA_ARB_TIMEOUT_TX_REG (DR_REG_AHB_GDMA_BASE + 0x3cc)
/** GDMA_ARB_TIMEOUT_TX : R/W; bitpos: [15:0]; default: 0;
 *  Configures the time slot for TX. Measurement unit: AHB bus clock cycle.
 */
#define GDMA_ARB_TIMEOUT_TX    0x0000FFFFU
#define GDMA_ARB_TIMEOUT_TX_M  (GDMA_ARB_TIMEOUT_TX_V << GDMA_ARB_TIMEOUT_TX_S)
#define GDMA_ARB_TIMEOUT_TX_V  0x0000FFFFU
#define GDMA_ARB_TIMEOUT_TX_S  0

/** GDMA_ARB_TIMEOUT_RX_REG register
 *  RX arbitration timeout configuration register
 */
#define GDMA_ARB_TIMEOUT_RX_REG (DR_REG_AHB_GDMA_BASE + 0x3d0)
/** GDMA_ARB_TIMEOUT_RX : R/W; bitpos: [15:0]; default: 0;
 *  Configures the time slot for RX. Measurement unit: AHB bus clock cycle.
 */
#define GDMA_ARB_TIMEOUT_RX    0x0000FFFFU
#define GDMA_ARB_TIMEOUT_RX_M  (GDMA_ARB_TIMEOUT_RX_V << GDMA_ARB_TIMEOUT_RX_S)
#define GDMA_ARB_TIMEOUT_RX_V  0x0000FFFFU
#define GDMA_ARB_TIMEOUT_RX_S  0

/** GDMA_WEIGHT_EN_TX_REG register
 *  TX weight arbitration enable register
 */
#define GDMA_WEIGHT_EN_TX_REG (DR_REG_AHB_GDMA_BASE + 0x3d4)
/** GDMA_WEIGHT_EN_TX : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable weight arbitration for TX.\\0: Disable\\1: Enable\\
 */
#define GDMA_WEIGHT_EN_TX    (BIT(0))
#define GDMA_WEIGHT_EN_TX_M  (GDMA_WEIGHT_EN_TX_V << GDMA_WEIGHT_EN_TX_S)
#define GDMA_WEIGHT_EN_TX_V  0x00000001U
#define GDMA_WEIGHT_EN_TX_S  0

/** GDMA_WEIGHT_EN_RX_REG register
 *  RX weight arbitration enable register
 */
#define GDMA_WEIGHT_EN_RX_REG (DR_REG_AHB_GDMA_BASE + 0x3d8)
/** GDMA_WEIGHT_EN_RX : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable weight arbitration for RX.\\0: Disable\\1: Enable\\
 */
#define GDMA_WEIGHT_EN_RX    (BIT(0))
#define GDMA_WEIGHT_EN_RX_M  (GDMA_WEIGHT_EN_RX_V << GDMA_WEIGHT_EN_RX_S)
#define GDMA_WEIGHT_EN_RX_V  0x00000001U
#define GDMA_WEIGHT_EN_RX_S  0

#ifdef __cplusplus
}
#endif
